<a href="https://colab.research.google.com/github/akmal1994/Akmal-Jah-Quamri/blob/master/003_Customer_Churn_Naive_Bayes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()
mydata=pd.read_csv("bank_customer_classification.csv")
mydata.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [ ]:
df=mydata.iloc[:,3:]
df.head()

y=df.iloc[:,-1]
y.head()

X=df.iloc[:,:- 1]
X.head()
#Basic Data Preprocessing

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,Female,42,2,0.00,1,1,1,101348.88
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58
2,502,France,Female,42,8,159660.80,3,1,0,113931.57
3,699,France,Female,39,1,0.00,2,0,0,93826.63
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10

In [ ]:
y.head()

0    1
1    0
2    1
3    0
4    0
Name: Exited, dtype: int64

In [ ]:
# Create Dummy Variables
geo=pd.get_dummies(X.iloc[:,1],drop_first=True)
gen=pd.get_dummies(X.iloc[:,2],drop_first=True)

#Drop Old Variables which are replaced by Dumay Variables
X.head()
X=X.drop(['Geography','Gender'],axis=1)
X.head()
X=pd.concat([X,geo,gen],axis=1)
X.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Germany,Spain,Male
0,619,42,2,0.00,1,1,1,101348.88,0,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,1,0
2,502,42,8,159660.80,3,1,0,113931.57,0,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,1,0

In [ ]:
## Train Test Split

from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.33, random_state=42)

In [ ]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()

X_train=sc.fit_transform(X_train)
X_train=pd.DataFrame(X_train,columns=X_test.columns)

X_test=sc.transform(X_test)
X_test=pd.DataFrame(X_test,columns=X_train.columns)

In [ ]:
X_train.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Germany,Spain,Male
0,1.675888,-0.941837,0.009343,0.478618,-0.904718,-1.546185,-1.035557,1.504937,1.748756,-0.579878,-1.100223
1,0.303207,-0.179872,1.046877,-0.046891,0.819780,0.646753,0.965664,-1.311771,1.748756,-0.579878,0.908906
2,-0.102358,0.963076,-0.336502,0.712431,-0.904718,0.646753,-1.035557,-1.320815,1.748756,-0.579878,0.908906
3,-0.414331,-0.751346,1.046877,0.669297,-0.904718,0.646753,0.965664,-0.812483,-0.571835,-0.579878,-1.100223
4,-0.684708,-0.560855,1.392721,-1.216488,-0.904718,0.646753,-1.035557,-1.628920,-0.571835,-0.579878,0.908906

In [ ]:
type(X_train.values)

numpy.ndarray

In [ ]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [ ]:
# Fitting the model on training data
model.fit(X_train,y_train)

GaussianNB()

In [ ]:
y_pred= model.predict(X_test)

In [ ]:
y_pred

array([0, 0, 0, ..., 0, 0, 1], dtype=int64)

In [ ]:
from sklearn.metrics import accuracy_score

In [ ]:
accuracy_score(y_test,y_pred)

0.8324242424242424

In [ ]:
(y_pred==y_test).mean()

0.8324242424242424

In [ ]:
from sklearn.svm import SVC
model1=SVC(kernel='linear',C=1)

In [ ]:
model1.fit(X_train,y_train)

SVC(C=1, kernel='linear')

In [ ]:
y_pred1=model1.predict(X_test)

In [ ]:
(y_pred1==y_test).mean()

0.8051515151515152